import 'package:charoz/Utilty/Constant/my_style.dart';
import 'package:charoz/Utilty/Widget/screen_widget.dart';
import 'package:flutter/material.dart';
import 'package:responsive_sizer/responsive_sizer.dart';

class PrivacyPolicy extends StatelessWidget {
  const PrivacyPolicy({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SafeArea(
      top: false,
      child: Scaffold(
        body: Stack(
          children: [
            Positioned.fill(
              top: 6.h,
              child: SingleChildScrollView(
                child: Padding(
                  padding: EdgeInsets.all(5.w),
                  child: buildText(),
                ),
              ),
            ),
            ScreenWidget().appBarTitle('นโยบายความเป็นส่วนตัว'),
            ScreenWidget().backPage(context),
          ],
        ),
      ),
    );
  }

  Text buildText() {
    return Text(
      'นโยบายความเป็นส่วนตัวของเราจะช่วยให้คุณเข้าใจถึงข้อมูลที่เรารวบรวมที่ Charoz วิธีที่ Charoz ใช้ข้อมูล และคุณมีตัวเลือกอะไรบ้าง [บริษัท/AppName] สร้างแอป [AppName] เป็นแอปฟรี บริการนี้จัดทำโดย Charoz โดยไม่มีค่าใช้จ่ายและมีจุดประสงค์เพื่อการใช้งานตามที่เป็นอยู่ หากคุณเลือกใช้บริการของเรา แสดงว่าคุณตกลงที่จะรวบรวมและใช้ข้อมูลที่สัมพันธ์กับนโยบายนี้ ข้อมูลส่วนบุคคลที่เรารวบรวมนั้นใช้เพื่อจัดหาและปรับปรุงบริการ เราจะไม่ใช้หรือแบ่งปันข้อมูลของคุณกับใคร ยกเว้นตามที่อธิบายไว้ในนโยบายความเป็นส่วนตัวนี้\nข้อกำหนดที่ใช้ในนโยบายความเป็นส่วนตัวนี้มีความหมายเช่นเดียวกับในข้อกำหนดและเงื่อนไขของเรา ซึ่งสามารถเข้าถึงได้ในเว็บไซต์ของเรา เว้นแต่จะกำหนดไว้เป็นอย่างอื่นในนโยบายความเป็นส่วนตัวนี้\n\nการรวบรวมและการใช้ข้อมูล\nเพื่อประสบการณ์ที่ดีขึ้นในขณะที่ใช้บริการของเรา เราอาจขอให้คุณให้ข้อมูลที่สามารถระบุตัวบุคคลได้ ซึ่งรวมถึงแต่ไม่จำกัดเพียงชื่อผู้ใช้ ที่อยู่อีเมล เพศ สถานที่ รูปภาพ ข้อมูลที่เราร้องขอจะถูกเก็บไว้โดยเราและใช้ตามที่อธิบายไว้ในนโยบายความเป็นส่วนตัวนี้\nแอพใช้บริการของบุคคลที่สามซึ่งอาจรวบรวมข้อมูลที่ใช้ในการระบุตัวคุณ\n\nคุ้กกี้\nคุกกี้คือไฟล์ที่มีข้อมูลจำนวนเล็กน้อยซึ่งโดยทั่วไปจะใช้ตัวระบุที่ไม่ระบุตัวตน สิ่งเหล่านี้จะถูกส่งไปยังเบราว์เซอร์ของคุณจากเว็บไซต์ที่คุณเยี่ยมชมและเก็บไว้ในหน่วยความจำภายในของอุปกรณ์\nบริการนี้ไม่ได้ใช้ “คุกกี้” เหล่านี้อย่างชัดเจน อย่างไรก็ตาม แอพอาจใช้รหัสและไลบรารีของบุคคลที่สามที่ใช้ “คุกกี้” เพื่อรวบรวมข้อมูลและปรับปรุงบริการของพวกเขา คุณมีตัวเลือกที่จะยอมรับหรือปฏิเสธคุกกี้เหล่านี้ และรู้ว่าเมื่อใดที่คุกกี้จะถูกส่งไปยังอุปกรณ์ของคุณ หากคุณเลือกที่จะปฏิเสธคุกกี้ของเรา คุณอาจไม่สามารถใช้บริการบางส่วนได้\n\nข้อมูลสถานที่\nบริการบางอย่างอาจใช้ข้อมูลตำแหน่งที่ส่งจากโทรศัพท์มือถือของผู้ใช้ เราใช้ข้อมูลนี้ภายในขอบเขตที่จำเป็นสำหรับบริการที่กำหนดเท่านั้น\n\nข้อมูลอุปกรณ์\nเรารวบรวมข้อมูลจากอุปกรณ์ของคุณในบางกรณี ข้อมูลจะถูกนำไปใช้เพื่อการให้บริการที่ดีขึ้นและเพื่อป้องกันการกระทำที่เป็นการฉ้อโกง นอกจากนี้ ข้อมูลดังกล่าวจะไม่รวมถึงข้อมูลที่จะระบุผู้ใช้แต่ละราย\n\nผู้ให้บริการ\nเราอาจจ้างบริษัทและบุคคลภายนอกด้วยเหตุผลดังต่อไปนี้:\n- เพื่ออำนวยความสะดวกในการให้บริการของเรา\n- เพื่อให้บริการในนามของเรา\n- เพื่อดำเนินการบริการที่เกี่ยวข้องกับบริการ หรือ\n- เพื่อช่วยเราในการวิเคราะห์วิธีการใช้บริการของเรา\nเราต้องการแจ้งผู้ใช้บริการนี้ว่าบุคคลภายนอกเหล่านี้สามารถเข้าถึงข้อมูลส่วนบุคคลของคุณได้ เหตุผลก็คือการทำงานที่ได้รับมอบหมายให้พวกเขาในนามของเรา อย่างไรก็ตาม พวกเขามีหน้าที่ไม่เปิดเผยหรือใช้ข้อมูลเพื่อวัตถุประสงค์อื่นใด\n\nความปลอดภัย\nเราให้ความสำคัญกับความไว้วางใจของคุณในการให้ข้อมูลส่วนบุคคลของคุณแก่เรา ดังนั้นเราจึงพยายามใช้วิธีการปกป้องข้อมูลที่ยอมรับได้ในเชิงพาณิชย์ แต่อย่าลืมว่าไม่มีวิธีการส่งข้อมูลทางอินเทอร์เน็ตหรือวิธีการจัดเก็บข้อมูลอิเล็กทรอนิกส์ใดที่ปลอดภัยและเชื่อถือได้ 100% และเราไม่สามารถรับประกันความปลอดภัยได้อย่างสมบูรณ์\n\nความเป็นส่วนตัวของเด็ก\nบริการนี้ไม่ได้ระบุถึงผู้ใดก็ตามที่อายุต่ำกว่า 13 ปี เราไม่ได้เก็บรวบรวมข้อมูลส่วนบุคคลที่สามารถระบุตัวตนได้จากเด็กอายุต่ำกว่า 13 ปีโดยเจตนา ในกรณีที่เราพบว่าเด็กอายุต่ำกว่า 13 ปีได้ให้ข้อมูลส่วนบุคคลแก่เรา เราจะลบข้อมูลนี้ออกจากเซิร์ฟเวอร์ของเราทันที หากคุณเป็นพ่อแม่หรือผู้ปกครองและคุณทราบว่าบุตรหลานของคุณได้ให้ข้อมูลส่วนบุคคลแก่เรา โปรดติดต่อเราเพื่อให้เราสามารถดำเนินการที่จำเป็นได้\n\nการเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้\nเราอาจอัปเดตนโยบายความเป็นส่วนตัวเป็นครั้งคราว ดังนั้น คุณควรตรวจสอบหน้านี้เป็นระยะสำหรับการเปลี่ยนแปลงใดๆ เราจะแจ้งให้คุณทราบถึงการเปลี่ยนแปลงใด ๆ โดยการโพสต์นโยบายความเป็นส่วนตัวใหม่ในหน้านี้ การเปลี่ยนแปลงเหล่านี้จะมีผลทันทีหลังจากโพสต์ในหน้านี้\n\nติดต่อเรา\nหากคุณมีคำถามหรือข้อเสนอแนะเกี่ยวกับนโยบายความเป็นส่วนตัวของเรา โปรดติดต่อเรา\nข้อมูลติดต่อ:\nอีเมล์: kittipong_kc47@hotmail.com',
      style: MyStyle().normalBlack16(),
    );
  }
}
